using Tyuiu.RomashkinaPB.Sprint2.Task1.V4.Lib;

//ТЕОРИЯ
// логические операции(|, &, ||, &&, &, ^)
// Операция |
// Операция логического сложения или логическое или.
// Возвращает true, если хотя бы один из операндов возвращает true. 
// bool x1 - (15 > 16) | (14 < 16); // 15 › 16 - false, 14 ‹ 16 - true, поэтому возвращается true 
// bool x2 - (15 > 16) | (14 > 16); // 15 › 16 - false, 14 › 16 - false, поэтому возвращается false

//Операция &
// Операция логического умножения или логическое И.
// Возвращает true, если оба операнда одновременно равны true.
// bool x1 = (15 > 16) & (14 < 16); //15 › 16 - false, 14 < 16 - true, поэтому возвращается false
// bool x2 = (15 < 16) & (14 < 16); // 15 < 16 - true, 14 < 16 - true, поэтому возвращается true

// Операция ||
// Операция логического сложения,
// Возвращает true, если хотя бы один из операндов возвращает true.
// bool x1 = (15 > 16) || (14 < 16); //15 > 16 - false, 14 < 16 - true, поэтому возвращается true
// bool x2 - (15 > 16) || (14 > 16); // 15 › 16 - false, 14 › 16 - false, поэтому возвращается false

// Операция &&
// Операция логического умножения, Возвращает true, если оба операнда одновременно равны true.
// bool x1 = (15 > 16) && (14 < 16); //15 > 16 - false, 14 < 16 - true, поэтому возвращается false
// bool x2 = (15 < 16) && (14 < 16); // 15 < 16 - true, 14 < 16 - true, поэтому возвращается true

//Операция!
// Операция логического отрицания.Производится над одним операндом и возвращает true,
// если операнд равен false. Если операнд равен true, то операция возвращает false:
//bool a = true;
// bool b = !a;      // false

// Операция ^
// Операция исключающего ИЛИ. Возвращает true,
// если либо первый, либо второй операнд (но не одновременно) равны true, иначе возвращает false
// bool x5 = (5 > 6) ^ (4 < 6);  //5 > 6 - false, 4 < 6 - true, поэтому возвращается true
// bool x6 - (50 > 6) ^ (4 / 2 < 3); // 50 > 6 - true, 4/2 < 3 - true, поэтому возвращается false

namespace Tyuiu.RomashkinaPB.Sprint2.Task1.V4
{
    internal class Program
    {
        static void Main(string[] args)
        {
            DataService ds = new DataService();

            int a = 175;
            int b = 176;
            int c = 414;
            int d = 414;

            bool[] res = new bool[6];
            res = ds.GetLogicOperations(a, b, c, d);
            
            
            Console.Title = "Спринт #2 | Выполнила: Ромашкина П. Б. | АСОиУб-26-1";
            Console.WriteLine("***************************************************************************");
            Console.WriteLine("* Спринт # 2                                                              *");
            Console.WriteLine("* Тема: Логические операции                                               *");
            Console.WriteLine("* Задание #1                                                              *");
            Console.WriteLine("* Вариант #4                                                              *");
            Console.WriteLine("* Выполнила: Ромашкина Полина Борисовна | АСОиУб-26-1                     *");
            Console.WriteLine("***************************************************************************");
            Console.WriteLine("* УСЛОВИЕ:                                                                *");
            Console.WriteLine("* Написать программу из операций сравнения ( ==, !=, <, >, <=, >=,        *");
            Console.WriteLine("* последовательность можно чередовать, но использовать 1 раз в выражении) *");
            Console.WriteLine("* и логических операций (|, &, ||, &&, !, ^, последовательность операций  *");
            Console.WriteLine("* не должна нарушаться), а также арефметических выражений, которая        *");
            Console.WriteLine("* ведет логическую последовательность (массив):                           *");
            Console.WriteLine("* (False, False, False, False, True, False), при a = 175, b = 176,        *");
            Console.WriteLine("* c = 414, d = 414                                                        *");
            Console.WriteLine("*                                                                         *");
            Console.WriteLine("***************************************************************************");
            Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                        *");
            Console.WriteLine("***************************************************************************");

            Console.WriteLine("a = " + a);
            Console.WriteLine("b = " + b);
            Console.WriteLine("c = " + c);
            Console.WriteLine("d = " + d);

            Console.WriteLine("***************************************************************************");
            Console.WriteLine("* РЕЗУЛЬТАТ:                                                              *");
            Console.WriteLine("***************************************************************************");

            for (int i = 0; i < 6; i++)
            {
                Console.WriteLine(res[i]);
            }

            Console.ReadKey();
        }
    }
}
